---
type: ChangeType
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ChangeType

`Autodesk.Revit.DB.ChangeType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ConcatenateChangeTypes | 2011 | `public static ChangeType ConcatenateChangeTypes ( ChangeType changeType1 , ChangeType changeType2 )` |
| Method | Contains | 2011 | `public bool Contains ( ChangeType changeType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsIdentical | 2011 | `public bool IsIdentical ( ChangeType changeType )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |